constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          14;
        startFace       23660;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          23;
        startFace       23623;
    }
    airfoil
    {
        type            wall;
        physicalType    wall;
        nFaces          92;
        startFace       23689;
    }
    top
    {
        type            symmetryPlane;
        physicalType    symmetryPlane;
        nFaces          14;
        startFace       23646;
    }
    bottom
    {
        type            symmetryPlane;
        physicalType    symmetryPlane;
        nFaces          15;
        startFace       23674;
    }
    frontAndBack
    {
        type            empty;
        physicalType    empty;
        nFaces          13544;
        startFace       10079;
    }
)

// ************************************************************************* //
